app/controllers/board_controller.rb

	def create
		title1 = params[:title]
		content1 = params[:content]
		Post.create(title: title1, content:content1)
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "pina coladas song"], ["content", "write to me and escape"], ["created_at", "2021-06-19 16:58:37.133760"], ["updated_at", "2021-06-19 16:58:37.133760"]]

	def update
		@post = Post.find(params[:id])
		@post.title = params[:title]
		@post.content = params[:content]
		@post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "내용이 사라졌다ㅠ"], ["updated_at", "2021-06-20 01:32:16.487684"], ["id", 29]]

	def delete
		@post= Post.find(params[:id])
		@post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]